# RbsFamilyContentOffsetWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFamilyContentOffsetWidth Property
ParameterTypeId Class See Also
---
"OffsetWidth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFamilyContentOffsetWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFamilyContentOffsetWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFamilyContentOffsetWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace